#include <iostream>
using namespace std;

int main()
{
    // K - номер дня року від 1 до 365
    // day - номер дня тижня
    int K, day;

    // Введення номера дня року
    cin >> K;

    // Оскільки 1 січня - понеділок,
    // знаходимо номер дня тижня
    day = K % 7;

    // Виведення номера дня тижня
    // 0 - неділя
    // 1 - понеділок
    // 2 - вівторок
    // 3 - середа
    // 4 - четвер
    // 5 - п'ятниця
    // 6 - субота
    cout << "Nomer dnya tyzhnya = " << day << endl;

    return 0;
}
